Anyc-Qing/AUTOSAR/core/system/Os/osal/ppc/mpc5xxx/kernel/irq_mpc5777c.h
/*-------------------------------- Arctic Core ------------------------------
 * Copyright (C) 2013, ArcCore AB, Sweden, www.arccore.com.
 * Contact: <contact@arccore.com>
 *
 * You may ONLY use this file:
 * 1)if you have a valid commercial ArcCore license and then in accordance with
 * the terms contained in the written license agreement between you and ArcCore,
 * or alternatively
 * 2)if you follow the terms found in GNU General Public License version 2 as
 * published by the Free Software Foundation and appearing in the file
 * LICENSE.GPL included in the packaging of this file or here
 * <http://www.gnu.org/licenses/old-licenses/gpl-2.0.txt>
 *-------------------------------- Arctic Core -----------------------------*/


#ifndef IRQ_MPC5777C_H_
#define IRQ_MPC5777C_H_

#define Irq_SOI()

typedef uint16 IrqType;

    /* Software interrupts. */
#define INTC_SSCIR0_CLR0    0
#define INTC_SSCIR0_CLR1    1
#define INTC_SSCIR0_CLR2    2
#define INTC_SSCIR0_CLR3    3
#define INTC_SSCIR0_CLR4    4
#define INTC_SSCIR0_CLR5    5
#define INTC_SSCIR0_CLR6    6
#define INTC_SSCIR0_CLR7    7
/*watchdog*/
#define MCM_MSWTIR_SWTAIC   8
/* fccu */
#define FCCU_ALARM          9
/* eDMA */
#define EDMA_ERRL_ERR31_0   10
#define EDMA_INTL_INT0      11
#define EDMA_INTL_INT1      12
#define EDMA_INTL_INT2      13
#define EDMA_INTL_INT3      14
#define EDMA_INTL_INT4      15
#define EDMA_INTL_INT5      16
#define EDMA_INTL_INT6      17
#define EDMA_INTL_INT7      18
#define EDMA_INTL_INT8      19
#define EDMA_INTL_INT9      20
#define EDMA_INTL_INT10     21
#define EDMA_INTL_INT11     22
#define EDMA_INTL_INT12     23
#define EDMA_INTL_INT13     24
#define EDMA_INTL_INT14     25
#define EDMA_INTL_INT15     26
#define EDMA_INTL_INT16     27
#define EDMA_INTL_INT17     28
#define EDMA_INTL_INT18     29
#define EDMA_INTL_INT19     30
#define EDMA_INTL_INT20     31
#define EDMA_INTL_INT21     32
#define EDMA_INTL_INT22     33
#define EDMA_INTL_INT23     34
#define EDMA_INTL_INT24     35
#define EDMA_INTL_INT25     36
#define EDMA_INTL_INT26     37
#define EDMA_INTL_INT27     38
#define EDMA_INTL_INT28     39
#define EDMA_INTL_INT29     40
#define EDMA_INTL_INT30     41
#define EDMA_INTL_INT31     42


#define SIU_PCSIFR_PCSI     43
#define PLL0_SR_LOLF_PLL1_SR_LOLF 44
#define SIU_OSR_OVF15_0     45
#define SIU_EISR_EIF0       46
#define SIU_EISR_EIF1       47
#define SIU_EISR_EIF2       48
#define SIU_EISR_EIF3       49
#define SIU_EISR_EIF15_4    50

/* emios */
#define eMIOS_0_GFLAG_F0    51
#define eMIOS_0_GFLAG_F1    52
#define eMIOS_0_GFLAG_F2    53
#define eMIOS_0_GFLAG_F3    54
#define eMIOS_0_GFLAG_F4    55
#define eMIOS_0_GFLAG_F5    56
#define eMIOS_0_GFLAG_F6    57
#define eMIOS_0_GFLAG_F7    58
#define eMIOS_1_GFLAG_F0    59
#define eMIOS_1_GFLAG_F1    60
#define eMIOS_1_GFLAG_F2    61
#define eMIOS_1_GFLAG_F3    62
#define eMIOS_1_GFLAG_F4    63
#define eMIOS_1_GFLAG_F5    64
#define eMIOS_1_GFLAG_F6    65
#define eMIOS_1_GFLAG_F7    66

/* eTPU */
#define eTPU_SCR_MCR_eTPU_A_B       67
#define eTPU_GCR_CISR_ENG1_eTPU_A_CIS0     68
#define eTPU_GCR_CISR_ENG1_eTPU_A_CIS1     69
#define eTPU_GCR_CISR_ENG1_eTPU_A_CIS2     70
#define eTPU_GCR_CISR_ENG1_eTPU_A_CIS3     71
#define eTPU_GCR_CISR_ENG1_eTPU_A_CIS4     72
#define eTPU_GCR_CISR_ENG1_eTPU_A_CIS5     73
#define eTPU_GCR_CISR_ENG1_eTPU_A_CIS6     74
#define eTPU_GCR_CISR_ENG1_eTPU_A_CIS7     75
#define eTPU_GCR_CISR_ENG1_eTPU_A_CIS8     76
#define eTPU_GCR_CISR_ENG1_eTPU_A_CIS9     77
#define eTPU_GCR_CISR_ENG1_eTPU_A_CIS10    78
#define eTPU_GCR_CISR_ENG1_eTPU_A_CIS11    79
#define eTPU_GCR_CISR_ENG1_eTPU_A_CIS12    80
#define eTPU_GCR_CISR_ENG1_eTPU_A_CIS13    81
#define eTPU_GCR_CISR_ENG1_eTPU_A_CIS14    82
#define eTPU_GCR_CISR_ENG1_eTPU_A_CIS15    83
#define eTPU_GCR_CISR_ENG1_eTPU_A_CIS16    84
#define eTPU_GCR_CISR_ENG1_eTPU_A_CIS17    85
#define eTPU_GCR_CISR_ENG1_eTPU_A_CIS18    86
#define eTPU_GCR_CISR_ENG1_eTPU_A_CIS19    87
#define eTPU_GCR_CISR_ENG1_eTPU_A_CIS20    88
#define eTPU_GCR_CISR_ENG1_eTPU_A_CIS21    89
#define eTPU_GCR_CISR_ENG1_eTPU_A_CIS22    90
#define eTPU_GCR_CISR_ENG1_eTPU_A_CIS23    91
#define eTPU_GCR_CISR_ENG1_eTPU_A_CIS24    92
#define eTPU_GCR_CISR_ENG1_eTPU_A_CIS25    93
#define eTPU_GCR_CISR_ENG1_eTPU_A_CIS26    94
#define eTPU_GCR_CISR_ENG1_eTPU_A_CIS27    95
#define eTPU_GCR_CISR_ENG1_eTPU_A_CIS28    96
#define eTPU_GCR_CISR_ENG1_eTPU_A_CIS29    97
#define eTPU_GCR_CISR_ENG1_eTPU_A_CIS30    98
#define eTPU_GCR_CISR_ENG1_eTPU_A_CIS31    99

/* eQADC */
#define EQADCA_FISRx_TORF   100       //@@ARCCORE changed from    EQADC_FISR_OVER
#define EQADCA_FISR0_NCF    101
#define EQADCA_FISR0_PF     102
#define EQADCA_FISR0_EOQF   103       //@@ARCCORE changed from   EQADC_FISR0_EOQF0

#define EQADCA_FISR0_CFFF   104
#define EQADCA_FISR0_RFDF   105
#define EQADCA_FISR1_NCF    106
#define EQADCA_FISR1_PF     107
#define EQADCA_FISR1_EOQF   108    //@@ARCCORE changed from   EQADC_FISR1_EOQF1
#define EQADCA_FISR1_CFFF   109
#define EQADCA_FISR1_RFDF   110
#define EQADCA_FISR2_NCF    111
#define EQADCA_FISR2_PF     112
#define EQADCA_FISR2_EOQF   113    //@@ARCCORE changed from   EQADC_FISR2_EOQF2
#define EQADCA_FISR2_CFFF   114
#define EQADCA_FISR2_RFDF   115
#define EQADCA_FISR3_NCF    116
#define EQADCA_FISR3_PF     117
#define EQADCA_FISR3_EOQF   118    //@@ARCCORE changed from    EQADC_FISR3_EOQF3
#define EQADCA_FISR3_CFFF   119
#define EQADCA_FISR3_RFDF   120
#define EQADCA_FISR4_NCF    121
#define EQADCA_FISR4_PF     122

#define EQADCA_FISR4_EOQF       123   //@@ARCCORE changed from EQADC_FISR4_EOQF
#define EQADCA_FISR4_CFFF       124
#define EQADCA_FISR4_RFDF       125
#define EQADCA_FISR5_NCF        126
#define EQADCA_FISR5_PF         127
#define EQADCA_FISR5_EOQF       128   //@@ARCCORE changed from   EQADC_FISR5_EOQF5
#define EQADCA_FISR5_CFFF       129
#define EQADCA_FISR5_RFDF       130
#define DSPIB_SR_TFUF_RFOF_SPEF_DPEF  131
#define DSPI_1_ISR_EOQF         132
#define DSPIB_SR_TFFF           133
#define DSPIB_SR_TCF_DDIF       134
#define DSPIB_SR_RFDF           135
#define DSPIC_SR_TFUF_RFOF_SPEF_DPEF  136
#define DSPI_2_ISR_EOQF         137
#define DSPIC_SR_TFFF           138
#define DSPIC_SR_TCF_DDIF       139
#define DSPIC_SR_RFDF           140
#define DSPID_SR_TFUF_RFOF_SPEF_DPEF  141
#define DSPI_3_ISR_EOQF         142
#define DSPID_SR_TFFF           143
#define DSPID_SR_TCF_DDIF       144
#define DSPID_SR_RFDF           145

#define ESCIA_COMBINED_INTR_RQST                         146
#define PCU_IR0_OIF_EIF                                  147
#define PCU_IR1_OIF_EIF                                  148

